Repository: julien-wff/easysave
Catalog: EasyCLI/Localization/Strings/Strings.*.resx
Languages: fr

# Commands.Help.Description
source: Display help on other commands
fr: Affiche l'aide pour les commandes

# Commands.Help.Args.Command.Description
source: Display help of a specific command
fr: Affiche l'aide pour une commande spécifique

# Commands.CommandNotFound
source: Command '{0}' not found. Try 'easysave help' for more information.
fr: Commande '{0}' introuvable. Essayez 'easysave help' pour plus d'informations.

# Commands.Help.GeneralHelp.Header
source: EasySave CLI Help Page Usage: easysave [command] [arguments] A CLI tool to backup your files Available commands:
fr: Page d'aide EasySave CLI Usage: easysave [commande] [arguments] Un outil en ligne de commande pour sauvegarder vos fichiers Commandes disponibles:

# Commands.Version.Description
source: Display the version of the application
fr: Affiche la version de l'application

# Commands.WrongArgumentCount
source: Command expects {0} argument(s), {1} given. Type 'easysave help {2}' for more information.
fr: La commande attend {0} argument(s), {1} fournis. Essayez 'easysave help {2}' pour plus d'informations.

# Commands.Version.Version
source: Easysave version {0} on {1}
fr: Easysave version {0} sur {1}

# Commands.Flags.InCommand
source: [flags]
fr: [drapeaux]

# Commands.Flags
source: Flags:
fr: Drapeaux :

# Commands.Create.Description
source: Create a new job in the state file
fr: Crée une nouvelle tâche dans le fichier état

# Commands.Create.Args.Name.Description
source: Name of the job to create
fr: Nom de la tâche créée

# Commands.Create.Args.Destination.Description
source: Destination folder to backup to
fr: Dossier de destination des sauvegardes

# Commands.Create.Args.Source.Description
source: Source folder to backup
fr: Dossier source à sauvegarder

# Commands.Create.Args.Type.Description
source: Type of backup to perform. Valid options and full and differential
fr: Type de sauvegarde à effectuer. Les options sont 'full' (complète) et 'differential' (différentielle)

# Checks.SourcePathInvalid
source: Source path is not valid.
fr: Chemin du dossier source invalide.

# Checks.DestinationPathInvalid
source: Destination path is not valid.
fr: Chemin du dossier de destination invalide.

# Checks.InvalidJobType
source: Invalid job type. Valid options are 'full' and 'differential'.
fr: Type de tâche invalide. Les options sont 'full' (complète) et 'differential' (differentielle)

# Job.Created
source: Job '{0}' created successfully with ID {1}.
fr: Tâche '{0}' créée avec succès, avec l'identifiant {1}.

# Commands.Check.Description
source: Checks if the config is valid, and if the state matches all the rules
fr: Vérifie la configuration des tâches, si elles respectent bien toutes les règles de bon fonctionnement.

# Commands.Check.Args.Jobs.Description
source: Jobs to check. Use format selector (1,2 or 1-3 or job1,2-4). Optional
fr: Tâches à vérifier. Utilisez le sélecteur de tâches (1,2 ou 1-3 ou tache1,2-4)

# Job.FetchError
source: Failed to fetch jobs from state file.
fr: Impossible de charger les tâches depuis le fichier état.

# Job.NoJobFound
source: No jobs found.
fr: Aucune tâche trouvée

# Job.JobInformation.Attributes
source: Source: {0} Destination: {1} Type: {2} State: {3}
fr: Source : {0} Destination : {1} Type : {2} État : {3}

# Job.CheckError
source: Job '{0}' (#{1}) is invalid: {2}
fr: Tâche '{0}' (#{1}) est invalide : {2}

# Commands.Check.Result
source: Check of {0} job(s) complete with {1} errors.
fr: Vérification de {0} tâche(s) terminée(s) avec {1} erreur(s).

# Checks.Valid
source: Check successful, no errors found.
fr: Succès de la vérification, aucune erreur trouvée.

# Checks.SourcePathDoesNotExist
source: Source path does not exist.
fr: Le chemin source n'existe pas.

# Checks.DestinationPathDoesNotExist
source: Destination path does not exist.
fr: Le chemin de destination n'existe pas.

# Checks.SharedRoot
source: Source and destination paths share the same root.
fr: Les chemins source et de destination partagent sont inclus l'un dans l'autre.

# Checks.DuplicateId
source: Job with the same ID already exists.
fr: Une tâche avec le même identifiant existe déjà.

# Checks.DuplicateName
source: Job with the same name already exists.
fr: Une tâche avec le même nom existe déjà.

# Checks.DuplicatePaths
source: Job with the same source and destination paths already exists.
fr: Une tâche avce le même fichier de source et de destination existe déjà.

# Checks.DestinationNotEmpty
source: Destination folder is not empty.
fr: Dossier de destination non vide.

# Commands.Edit.Description
source: Edit a job from the state file.
fr: Édite une tâche dans le fichier état.

# Commands.Edit.Args.Id.Description
source: Task ID
fr: Identifiant numérique de la tâche

# Commands.Edit.Args.Name.Description
source: New name of the task
fr: Nouveau nom de la tâche

# Commands.Edit.Args.Source.Description
source: New source folder
fr: Nouveau dossier source

# Commands.Edit.Args.Destination.Description
source: New destination folder
fr: Nouveau dossier de destination

# Commands.Edit.Flags.Type.Description
source: New type of the (full, differential or incremental)
fr: Nouveau type de sauvegarde (full, differential ou incremental)

# Checks.InvalidJobId
source: Invalid job ID
fr: Identifiant de tâche invalide

# Checks.JobNotFound
source: Cannot find job with ID #{0}
fr: Impossible de trouver la tâche avev l'identifiant #{0}

# Job.Edited
source: The job #{0} ({1}) has been edited successfully
fr: La tâche #{0} ({1}) à été éditée correctement
